      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Divisiones.
       AUTHOR. Mcniven
       INSTALLATION.
       DATE-WRITTEN.05/02/2026
       DATE-COMPILED.06/2/2026
       REMARKS.Este programa se creo para mostrar las divisiones de Cobol.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM Divisiones.
