      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CARACTERES-EDICION.
       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       01 NUM1 PIC 9999.99 VALUE 5000.75.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY NUM1.
            STOP RUN.
       END PROGRAM CARACTERES-EDICION.
