      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. VARIABLE-CPMPUESTA.
       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
       01 VARIABLE-COMPUESTA.
           02 NUM1 PIC 9 VALUE 2.
           02 NUM2 PIC 9 VALUE 4.
           02 NUM2 PIC 9 VALUE 4.
           02 NUM4 PIC 9 VALUE 9.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY VARIABLE-COMPUESTA.
            STOP RUN.
       END PROGRAM VARIABLE-CPMPUESTA.
